; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 383685 2 3 4 4 2
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	image1 - mode
	spectrograph3 - mode
	thermograph0 - mode
	thermograph2 - mode
	Star3 - direction
	Star2 - direction
	GroundStation1 - direction
	Star0 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph3)
	(supports instrument0 image1)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 spectrograph3)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon4)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(pointing satellite1 Star0)
	(have_image Phenomenon4 spectrograph3)
	(have_image Phenomenon5 spectrograph3)
))

)

; plan
1. (turn_to satellite1 star0 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star0)
   goals met: 1 of 4
2. (turn_to satellite0 groundstation1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation1)
   goals met: 2 of 4
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 4
4. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 2 of 4
5. (turn_to satellite0 phenomenon4 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon4)
   goals met: 1 of 4
6. (turn_to satellite1 phenomenon5 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon5)
   goals met: 0 of 4
7. (turn_to satellite0 groundstation1 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 4
8. (take_image satellite1 phenomenon5 instrument2 spectrograph3)
   added: (have_image phenomenon5 spectrograph3)
   goals met: 2 of 4
9. (turn_to satellite1 phenomenon4 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon4)
   goals met: 2 of 4
10. (take_image satellite1 phenomenon4 instrument2 spectrograph3)
   added: (have_image phenomenon4 spectrograph3)
   goals met: 3 of 4
11. (turn_to satellite1 star0 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star0)
   goals met: 4 of 4
